zephyrproject-rtos/trusted-firmware-m/platform/ext/target/nxp/frdmmcxa577/project_template/ns/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitENETPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitENETPins(void)
{
    /* PORT1: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT1);
    /* GPIO1: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO1);
    /* GPIO1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO1_RST_SHIFT_RSTn);
    /* PORT1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT1_RST_SHIFT_RSTn);
    /* ENET0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kENET0_RST_SHIFT_RSTn);
    /* T1S0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kT1S0_RST_SHIFT_RSTn);
    /* ADC0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kADC0_RST_SHIFT_RSTn);

    /* PORT1_10 (pin C2) is configured as P1_10 */
    PORT_SetPinMux(BOARD_INITENETPINS_EPHY_RSTB_PORT, BOARD_INITENETPINS_EPHY_RSTB_PIN, kPORT_MuxAlt0);

    PORT1->PCR[10] = ((PORT1->PCR[10] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_11 (pin C1) is configured as ENET0_RXD0 */
    PORT_SetPinMux(PORT1, 11U, kPORT_MuxAlt9);

    PORT1->PCR[11] = ((PORT1->PCR[11] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_12 (pin D2) is configured as ENET0_RXD1 */
    PORT_SetPinMux(PORT1, 12U, kPORT_MuxAlt9);

    PORT1->PCR[12] = ((PORT1->PCR[12] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_13 (pin D1) is configured as ENET0_RXDV */
    PORT_SetPinMux(PORT1, 13U, kPORT_MuxAlt9);

    PORT1->PCR[13] = ((PORT1->PCR[13] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_2 (pin A4) is configured as ENET0_MDC */
    PORT_SetPinMux(PORT1, 2U, kPORT_MuxAlt9);

    PORT1->PCR[2] = ((PORT1->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_3 (pin B4) is configured as ENET0_MDIO */
    PORT_SetPinMux(PORT1, 3U, kPORT_MuxAlt9);

    PORT1->PCR[3] = ((PORT1->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_4 (pin A3) is configured as ENET0_TX_CLK */
    PORT_SetPinMux(PORT1, 4U, kPORT_MuxAlt9);

    PORT1->PCR[4] = ((PORT1->PCR[4] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_5 (pin B3) is configured as ENET0_TXEN */
    PORT_SetPinMux(PORT1, 5U, kPORT_MuxAlt9);

    PORT1->PCR[5] = ((PORT1->PCR[5] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_6 (pin A2) is configured as ENET0_TXD0 */
    PORT_SetPinMux(PORT1, 6U, kPORT_MuxAlt9);

    PORT1->PCR[6] = ((PORT1->PCR[6] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_7 (pin A1) is configured as ENET0_TXD1 */
    PORT_SetPinMux(PORT1, 7U, kPORT_MuxAlt9);

    PORT1->PCR[7] = ((PORT1->PCR[7] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    gpio_pin_config_t EPHY_RSTB_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_10 (pin C2)  */
    GPIO_PinInit(BOARD_INITENETPINS_EPHY_RSTB_GPIO, BOARD_INITENETPINS_EPHY_RSTB_PIN, &EPHY_RSTB_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSPIFILTERPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: F11, peripheral: FLEXSPI0, signal: FLEXSPI_B_SCLK, pin_signal: P3_16/LPUART4_RTS_B/CT_INP8/ESPI0_CLK/FLEXIO0_D24/LPSPI3_SCK/FLEXSPI0_B_SCLK/SMARTDMA_PIO16/PF_SPI_SCKIN,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: G10, peripheral: SPI_Filter, signal: pf_spi_csn, pin_signal: P3_17/WUU0_IN26/LPUART4_CTS_B/CT_INP9/ESPI0_CSN/FLEXIO0_D25/LPSPI3_PCS0/FLEXSPI0_B_SS0_B/SMARTDMA_PIO17/PF_SPI_CS0_N,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: G13, peripheral: FLEXSPI0, signal: FLEXSPI_B_DATA0, pin_signal: P3_15/LPUART2_TXD/LPUART3_RTS_B/CT_INP7/ESPI0_DATA0/FLEXIO0_D23/LPSPI3_SDO/FLEXSPI0_B_DATA0/SMARTDMA_PIO15/PF_SPI_DATA,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: F12, peripheral: FLEXSPI0, signal: FLEXSPI_B_DATA1, pin_signal: P3_14/WUU0_IN25/LPUART2_RXD/LPUART3_CTS_B/CT_INP6/ESPI0_DATA1/FLEXIO0_D22/LPSPI3_SDI/FLEXSPI0_B_DATA1/SMARTDMA_PIO14,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: F13, peripheral: FLEXSPI0, signal: FLEXSPI_B_DATA2, pin_signal: P3_13/LPUART2_CTS_B/LPUART3_RXD/CT1_MAT3/ESPI0_DATA2/FLEXIO0_D21/LPSPI3_PCS2/FLEXSPI0_B_DATA2/SMARTDMA_PIO13/PF_SPI_CS0_DIS_N,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: E12, peripheral: FLEXSPI0, signal: FLEXSPI_B_DATA3, pin_signal: P3_12/LPUART2_RTS_B/LPUART3_TXD/CT1_MAT2/ESPI0_DATA3/FLEXIO0_D20/LPSPI3_PCS3/FLEXSPI0_B_DATA3/SMARTDMA_PIO12/PF_SPI_CS1_DIS_N,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: A13, peripheral: SPI_Filter, signal: pf_qspi_cs0_dis_n, pin_signal: P3_0/WUU0_IN22/TRIG_IN0/LPI2C3_SDA/LPUART3_RXD/CT_INP16/FLEXIO0_D8/LPSPI3_PCS0/FLEXSPI0_A_SS0_B/SMARTDMA_PIO0/PF_QSPI_CS0_DIS,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: B12, peripheral: SPI_Filter, signal: pf_qspi_cs1_dis_n, pin_signal: P3_1/TRIG_IN1/LPI2C3_SCL/LPUART3_TXD/CT_INP17/FLEXIO0_D9/LPSPI3_PCS1/FLEXSPI0_B_DQS/FLEXSPI0_A_SS1_B/SMARTDMA_PIO1/PF_QSPI_CS1_DIS,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: B13, peripheral: SPI_Filter, signal: pf_qspi_csn, pin_signal: P3_6/CLKOUT/LPSPI1_PCS3/LPUART3_RTS_B/CT4_MAT2/FLEXIO0_D14/LPSPI3_PCS1/FLEXSPI0_B_SS1_B/FLEXSPI0_A_DQS/SMARTDMA_PIO6/PF_QSPI_CS_N,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: C12, peripheral: SPI_Filter, signal: pf_qspi_sckin, pin_signal: P3_7/TRIG_IN2/LPSPI1_PCS2/LPUART3_CTS_B/CT4_MAT3/FLEXIO0_D15/LPSPI3_SCK/FLEXSPI0_A_SCLK/SMARTDMA_PIO7/PF_QSPI_SCKIN,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: C13, peripheral: SPI_Filter, signal: 'pf_qspi_data, 0', pin_signal: P3_8/WUU0_IN23/TRIG_IN3/LPSPI1_SDO/LPUART1_RXD/CT_INP4/FLEXIO0_D16/LPSPI3_SDO/LPUART5_CTS_B/FLEXSPI0_A_DATA0/SMARTDMA_PIO8/PF_QSPI_DATA0,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: D12, peripheral: SPI_Filter, signal: 'pf_qspi_data, 1', pin_signal: P3_9/TRIG_IN4/LPSPI1_SDI/LPUART1_TXD/CT_INP5/FLEXIO0_D17/LPSPI3_SDI/LPUART5_RTS_B/FLEXSPI0_A_DATA1/SMARTDMA_PIO9/PF_QSPI_DATA1,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: D13, peripheral: SPI_Filter, signal: 'pf_qspi_data, 2', pin_signal: P3_10/TRIG_IN5/LPSPI1_SCK/LPUART1_RTS_B/CT1_MAT0/FLEXIO0_D18/LPSPI3_PCS2/LPUART5_TXD/FLEXSPI0_A_DATA2/SMARTDMA_PIO10/PF_QSPI_DATA2,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: E13, peripheral: SPI_Filter, signal: 'pf_qspi_data, 3', pin_signal: P3_11/WUU0_IN24/TRIG_IN6/LPSPI1_PCS0/LPUART1_CTS_B/CT1_MAT1/FLEXIO0_D19/LPSPI3_PCS3/LPUART5_RXD/FLEXSPI0_A_DATA3/SMARTDMA_PIO11/PF_QSPI_DATA3,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

